Version2/TestTool-Guinness/TestTool.Setup/Requests/Device Management/SetNetworkInterfaces/TC.DM.NVT.14_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetNetworkInterfaces>
      <tds:InterfaceToken>InterfaceToken1</tds:InterfaceToken>
      <tds:NetworkInterface>
        <tt:Enabled>true</tt:Enabled>
        <tt:Link>
          <tt:AutoNegotiation>true</tt:AutoNegotiation>
          <tt:Speed>10</tt:Speed>
          <tt:Duplex>Full</tt:Duplex>
        </tt:Link>
        <tt:MTU>1</tt:MTU>
        <tt:IPv4>
          <tt:Enabled>true</tt:Enabled>
          <tt:Manual>
            <tt:Address>192.168.10.42</tt:Address>
            <tt:PrefixLength>24</tt:PrefixLength>
          </tt:Manual>
          <tt:DHCP>true</tt:DHCP>
        </tt:IPv4>
      </tds:NetworkInterface>
    </tds:SetNetworkInterfaces>
  </soap:Body>
</soap:Envelope>